app/Http/Controllers/PermissionController.php

SELECT * FROM `roles`
SELECT * FROM `permissions`
---
    public function index(){

        $roles = Role::all();
        $permissions = Permission::all();